In [1]:
import pandas as pd

In [15]:
def top_3(years):
    df_list = []
    for year in years:
        path = f'C:\\Users\\poote\\NETOLOGY\\names\\yob{year}.txt'
        df = pd.read_csv(path, names = ['Name', 'Gender', 'Count'])
        df['Year'] = int(f'{year}')
        df_list.append(df)
    df_concat = pd.concat(df_list)
    df_concat.reset_index(inplace=True)
    top_names = df_concat.groupby(['Name']).sum()[['Count']]
    sort_names = top_names.sort_values(['Count'], ascending = False).head(3)
    return sort_names

In [22]:
top_3([1880])

         Count
Name
John      9701
William   9562
Mary      7092

In [21]:
top_3([1900, 1950, 2000])

         Count
Name
James   111789
John    109601
Robert  101368

In [31]:
def count_dynamics(years):
    df_list = []
    for year in years:
        path = f'C:\\Users\\poote\\NETOLOGY\\names\\yob{year}.txt'
        df = pd.read_csv(path, names = ['Name', 'Gender', 'Count'])
        df['Year'] = int(f'{year}')
        df_list.append(df)
    df_concat = pd.concat(df_list)
    df_concat.reset_index(inplace=True)
    dynamic = df_concat.groupby(['Gender', 'Year']).sum()[['Count']]
    return dynamic

In [33]:
count_dynamics([1900, 1950, 2000]).unstack('Year')

         Count
Year      1900     1950     2000
Gender
F       299798  1713065  1815295
M       150480  1790437  1963202